testCases/testCase_step_coarse_kunz_valgrind/system/controlDict
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format ascii;
 class dictionary;
 location "system";
 object controlDict;
}

application compMultiphaseCavitation;

startFrom latestTime; 	//compressibleMultiphaseInterFoam;

startTime 0;

stopAt endTime;

endTime 1.1e-06;

deltaT 1e-06;

writeControl adjustableRunTime; 	// timeStep; //

writeInterval 1e-06; 	//writeInterval   1;

purgeWrite 0;

writeFormat ascii;

writePrecision 9;

writeCompression no;
timeFormat fixed;

timePrecision 6;

runTimeModifiable yes;
adjustTimeStep no;
maxCo 0.75;

maxAlphaCo 0.25;

maxAcousticCo 2001; 	//maxDeltaT               1e-5;

functions
{
#includeFunc yPlus
} 	//#includeFunc    interPhaseChangeFoam_residuals//#includeFunc    CourantNo//#includeFunc    wallShearStress  //#includeFunc    flowType  //#includeFunc    MachNo  //#include "forces"//#include "forceCoeffs"/*    forces*//*    {*//*        type                forces;*//*        functionObjectLibs  ("libforces.so");*//*        outputControl       timeStep;*//*        outputInterval      1;*//*         *//*        patches             ( "airfoil" );*//*        rho                 rhoInf;*//*        rhoName             rhoInf;*//*        rhoInf              1000;*//*        pName               p;*//*        UName               U;*//*        rhoName             rhoInf;*//*        log                 true;*//*         *//*        CofR                (0.25 0 0);    *//*    }*//*    forceCoeffs*//*    {*//*        type                forceCoeffs;*//*        functionObjectLibs  ( "libforces.so" );*//*        outputControl       timeStep;*//*        outputInterval      1;*//*     *//*        patches             ( "airfoil" );*//*        pName               p;*//*        UName               U;*//*        rhoName             rhoInf;*//*        rho                 rhoInf;*//*        log                 true;*//*         *//*        liftDir             (0 0 1);*//*        dragDir             (-1 0 0);*//*        CofR                (0.25 0 0);*//*        pitchAxis           (0 1 0);*//*         *//*        magUInf             15.00;*//*        rhoInf              1000;*//*        lRef                1;*//*        Aref                1;*//*    }*/// ************************************************************************* //

