testCases/testCase_step_coarse_kunz_valgrind/system/controlDict_stage1
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     compressibleMultiphasePhaseChangeFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         1e-8;

deltaT          1e-9;

writeControl    adjustableRunTime; // timeStep; //

writeInterval   1e-9;
//writeInterval   1;

purgeWrite      0;

writeFormat     ascii;
    
writePrecision  9;

writeCompression off;

timeFormat      fixed;

timePrecision   9;

runTimeModifiable       yes;

adjustTimeStep          off;

maxCo                   0.1;
maxAlphaCo              0.1;

functions
{

    #includeFunc    interPhaseChangeFoam_residuals
    #includeFunc    CourantNo
    //#includeFunc    wallShearStress  
    //#includeFunc    flowType  
    #includeFunc    yPlus  
    //#includeFunc    MachNo  

    //#include "forces"
    //#include "forceCoeffs"
/*    forces*/
/*    {*/
/*        type                forces;*/
/*        functionObjectLibs  ("libforces.so");*/
/*        outputControl       timeStep;*/
/*        outputInterval      1;*/
/*         */
/*        patches             ( "airfoil" );*/
/*        rho                 rhoInf;*/
/*        rhoName             rhoInf;*/
/*        rhoInf              1000;*/
/*        pName               p;*/
/*        UName               U;*/
/*        rhoName             rhoInf;*/
/*        log                 true;*/
/*         */
/*        CofR                (0.25 0 0);    */
/*    }*/

/*    forceCoeffs*/
/*    {*/
/*        type                forceCoeffs;*/
/*        functionObjectLibs  ( "libforces.so" );*/
/*        outputControl       timeStep;*/
/*        outputInterval      1;*/
/*     */
/*        patches             ( "airfoil" );*/
/*        pName               p;*/
/*        UName               U;*/
/*        rhoName             rhoInf;*/
/*        rho                 rhoInf;*/
/*        log                 true;*/
/*         */
/*        liftDir             (0 0 1);*/
/*        dragDir             (-1 0 0);*/
/*        CofR                (0.25 0 0);*/
/*        pitchAxis           (0 1 0);*/
/*         */
/*        magUInf             15.00;*/
/*        rhoInf              1000;*/
/*        lRef                1;*/
/*        Aref                1;*/
/*    }*/

}


// ************************************************************************* //
