testCases/testCase_step_coarse_kunz_valgrind/constant/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phases (water vapor);

pSat            [1 -1 -2 0 0 0 0] 2337;   // Saturation pressure

sigma           [1 0 -2 0 0 0 0] 0.07;

// pMin is set for a cavNumber = 0.4 with pSat = 2337
// For this solver to make sense, the pMin value has to be chosen such, that the 
// negative pressure coefficient of the vapor phase is equal to the expected
// cavitation number
pMin            [1 -1 -2 0 0 0 0] 200;

sigmas
(
    (water vapor) 0.07
);


MultiphaseCavitation Kunz;
//CavitationPhaseChange SchnerrSauer;
//phaseChangeTwoPhaseMixture Kunz;

// Surface tension coefficients
sigma12           sigma12 [1 0 -2 0 0 0 0] 0.05;
sigma13           sigma13 [1 0 -2 0 0 0 0] 0.04;

// Diffusivity between miscible phases
D23               D23   [0 2 -1 0 0 0 0]  3e-09;

KunzCoeffs
{
    UInf            UInf   [0 1 -1 0 0 0 0]     1.6;
    tInf            tInf   [0 0 1 0 0 0 0]      0.0625; // L = 0.1 m ; tInf = L/Uinf
    Cc              Cc     [0 0 0 0 0 0 0]      1000;
    Cv              Cv     [0 0 0 0 0 0 0]      1000;
}

VentilatedKunzCoeffs
{
    UInf            UInf   [0 1 -1 0 0 0 0]     10.0;
    tInf            tInf   [0 0 1 0 0 0 0]      0.005; // L = 0.1 m
    Cc              Cc     [0 0 0 0 0 0 0]      1000;
    Cv              Cv     [0 0 0 0 0 0 0]      1000;
}

MerkleCoeffs
{
    UInf            UInf   [0 1 -1 0 0 0 0]     10.0;
    tInf            tInf   [0 0 1 0 0 0 0]      0.005;  // L = 0.1 m
    Cc              Cc     [0 0 0 0 0 0 0]      80;
    Cv              Cv     [0 0 0 0 0 0 0]      1e-03;
}

SchnerrSauerCoeffs
{
    n               n      [0 -3 0 0 0 0 0]     1.6e+13;
    dNuc            dNuc   [0 1 0 0 0 0 0]      2.0e-06;
    Cc              Cc     [0 0 0 0 0 0 0]      1;
    Cv              Cv     [0 0 0 0 0 0 0]      1;
}



// ************************************************************************* //
